{
  "Attrs": {
    "Copyright": "© John Stewart, All Rights Reserved",
    "Guitar Tabulature": "John Stewart Lyrics Database",
    "Lyrics": "If you're with me on this and it all came from God\nRight down from the lightening to the lightening rod\nI said it all came from God, the crooked and the level\nBlack and white, Christ and the Devil\n\nWell they say He decided to make it a game\nAnd He gave them all faces, He gave them all names\nHe said \"We going to do it, let's do it nice\"\nAnd he appointed the captains, the Devil and Christ\n\nLike heavyweight champs after the fight\nDoes Christ hang out with the Devil tonight? Yeah, yeah\n\nWell Christ said to the Devil \"You got the first hit\nYou gave the apple to Eve but it was Adam who bit\"\nAnd the Devil said to Christ \"Yeah I learned how to fake it\nYou be surprised what they'll take from a snake yeah\"\n\nChrist said to the Devil \"Are you pulling no rug?\nYou never said that you'd come up with drugs\"\n\"Heroine was cool\" he said \"Cocaine was fact\nI did some refining and I'm calling it crack\"\n\n\"It all works for me\" the Devil just smiled\nPicking his teeth with the bones of a child\n\nLike heavyweight champs after the fight\nDoes Christ hang out with the Devil tonight? \nDoes Christ hang out with the Devil tonight? Yeah, yeah\n\nThe Devil said to Christ \"Let's just see how it ends\nTo tell you the truth, I don't have any friends\n'Cause I'm in it for the money, in it for the fame\nThey don't give a damn who flies the flame\"\n\nThe Devil said to Christ \"The best part of the game\nAre all of the people that I kill in your name\"\n\nLike heavyweight champs after the fight\nDoes Christ hang out with the Devil tonight? \nDoes Christ hang out with the Devil tonight? Yeah, yeah\n\nLike heavyweight champs after the fight\nDoes Christ hang out with the Devil tonight? \n\nLike heavyweight champs after the fight\nDoes Christ hang out with the Devil tonight?  Yeah, yeah\n\n",
    "Lyrics Detail": "John Stewart Lyrics Database",
    "Recording": "Neon Beach (Homecoming, 700, 1990)",
    "Songwriter": "John Stewart",
    "Tab": "\n\n",
    "Title": "STRANGE ALLIANCE"
  },
  "Critera": {
    "Recording": [
      "Neon Beach"
    ],
    "songwriter": [
      "John Stewart"
    ]
  },
  "id": 258
}