{
  "Attrs": {
    "Copyright": "© John Stewart, All Rights Reserved",
    "Guitar Tabulature": "John Stewart Lyrics Database",
    "Lyrics": "Strange day\nStrange day\nStrange day in Hogsville, USA\n\nI remember when I rode into town that morning in December of aught forty eight -ohohoh, bitter cold. I had on my parka, my sheepskin coat and my brown and white spectator pumps. Cut quite a figure if I do say so. First thing I spied was a poster\n\"There's Going to Be a Dance\nThe Second Annual Hogsville Dandy Steppers Ball and Frog Popping Contest\nDrag.\"\n\nStrange day\nStrange day\nStrange day in Hogsville, USA\n\nI noticed right off that there weren't no lady folk in sight. I figured they was all up a'primpin' for the dance. And, being a man of no small charms with the ladies myself, I decided to park Old Paint and change my socks - from him to me.\n(I find that extremely offensive.)\n(So did Old Paint.)\n\nBut, there wern't no gals for miles around\nNot one gal in the whole darn town\nSo, if you want to go dancing just look around\nFor the next best thing that can be found\n\nStrange day\nStrange day\nStrange day in Hogsville, USA\n\nThat's right. I soon found there wasn't no women, nowhere. The fellas going to the dance were taking some of the strangest things. One was taking a broom. All dressed up in a pinafore. Bleached straw. Looked kinda cheap to me. 'Nother was totin' a picture of a gal. Been hidin' it under his bunk. Been going with that picture so long, he thought real girls folded in the middle.\n\nNow, I was getting depressed. Then, I spied the cutest little thing you ever saw giving me the eye from underneath the water trough. Had little eyes, curly tail, and the dearest little pointy ears you've ever seen. I grabbed her paw and waddled into the dance.\n(What did her pa have to say?)\n(Shut it up when he's talkin'!)\nThe minute we got into the dance the music stopped and the fiddler said,\n\"Waaaaaaaiiiiit a minute! Thththththat's the sheriff's gal!\"\n\"You mean . . . .?\"\n\nStrange day\nStrange day\nStrange day in Hogsville\n(You know, I really loved the little thing. I can still hear her little voice.)\n(Oink, oink, oink, oink, oink, oink, oink\nOink, oink, oink, oink, oink, oink, oink)\nUSA\n\n",
    "Lyrics Detail": "John Stewart Lyrics Database",
    "Recording": "Something Special (The Kingston Trio - 1962, Capitol T/ST 1747)\nThe Stewart Years (The Kingston Trio - 2000, Bear Family Records LC05197)",
    "Songwriter": "John Stewart and George Yanok",
    "Tab": "\n\n",
    "Title": "STRANGE DAY"
  },
  "Critera": {
    "Recording": [
      "Something Special",
      "The Stewart Years",
      "The Trio Years"
    ],
    "songwriter": [
      "John Stewart",
      "John Stewart and George Yanok"
    ]
  },
  "id": 375
}