{
  "Attrs": {
    "Copyright": "© John Stewart, All Rights Reserved",
    "Guitar Tabulature": "John Stewart Lyrics Database",
    "Lyrics": "Where is the road?\nCyrus Avery’s ribbon of dreams\nThat ran away from Chicago to the Pacific Ocean to connect the Mid-West and the Promised land.\nA concrete artery for the American Dream\nFor the automobile for the restless traveler\nWhere is the road that wouldn’t  die\nIn 1977 when they took down the last highway Sign and thought it would just go away,\nBut it wouldn’t just go away.\nIt wasn’t just a road Cyrus Avery's ribbon of Dreams, It was Pop Hicks Diner with\nHoward and Mary Nichols In Clinton Oklahoma\nWhere the heart beat of what John Steinbeck\nCalled the Mother Road\nWas heard over the sound of coffee cups\nKnocking against plates of Spanish Omelettes\nAnd home fries\nWhere is the Road that Tom Joad traveled west\nFrom Oklahoma with his family\nAnd tethered mattresses in the \nGrapes of Wrath.\nWhere Ernest Hemingway sat and sipped wine\nIn the Villa Cuberto in Albuqerque New Mexico\nWhere he wrote The Old Man and The Sea.\nWhere is the road that refused to die,\nAs the signs saying Route 66 began to            Reappear on the sides of buildings, shops and Sheds as if by magic.\nAs if Route 66 signs that appeared painted\nOn the very concrete itself were a kind of \nStigmata of the American dream.\nWhere Will Rogers once stood in the Coleman Theatre in Miami Oklahoma\nAnd re-defined the image of a country\nWith a reality check that long outlived\nEven Rogers himself. as the road became Known as  The Will Rogers Highway.\nAnd the Coleman Theatre still stands beside 66\nWith an ornate style that screams \"I am alive\"\nAgainst the Oklahoma horizon\nWhere is the road where Stanley Marsh planted\nTen Cadillacs in the ground outside Amarillo Texas and Cadillac Ranch \nBecame visual rock and roll.\nThe road runs from Tucumcari\nTo Flagstaff, through Meteor City and Winslow Arizona with the line of a spider vein on the Thigh of a runway dancer.\nThe road cuts through the Mohave Desert\nWhere sidewinders find the shade\nIn the shadows of abandoned oldsmobiles\nBleached into rusted skeletons\nLike those that lie beneath the \nWhite hot sand of Americas highway.\nThen  it’s Azusa, Pasadena and Pomona\nWhere harness horses walk under wool \nBlankets in endless circles at the L.A. County Fairgrounds and the solid air of Los Angeles Hangs like the smoke of a \nHollywood Hills pot party\nOver the fading walls of the Miracle Mile.\nWhere is the road that stops at the Santa Monica Pier Where Crips and Bloods strut their Territory over weather boards that still shake The feet of tourists and the sound of a carousel Spinning it’s innocence in what’s left of the Promised Land.\nWhere is the road?\nI must find out.\n\n",
    "Lyrics Detail": "John Stewart Lyrics Database",
    "Recording": "Rough Sketches (Folk Era, FE1437D, 1997)",
    "Songwriter": "John Stewart",
    "Tab": "\n\n",
    "Title": "THE ROAD"
  },
  "Critera": {
    "Recording": [
      "Rough Sketches"
    ],
    "songwriter": [
      "John Stewart"
    ]
  },
  "id": 32
}