{
  "Attrs": {
    "Copyright": "© John Stewart, All Rights Reserved",
    "Guitar Tabulature": "John Stewart Lyrics Database",
    "Lyrics": "John Glenn is going to ride the lightning one more time, \nand we're all going to ride it with him, once again. \n\nNot just as one of the old guard out to redefine aging… \nbut as a reluctant keeper of the flame from long ago and shining times…. \n\nHe's going to climb that rocket one more time. \n\nA lost hero of the Heartland past, who came out of the fog of transparent heroes, and tacky headlines… \n\nTo ride the lightning one more time. \n\nOn the marshes of Cape Canaveral and Cocoa Beach \nAmidst the ghosts of Grissom, White, Chaffey, Shepherd, McAulliffe \nand all of the Challenger crew who rode the lightning one last time. \n\nHe's going to climb aboard and buckle in.. \n\nCarrying the relics of the New Frontier and Camelot. \n\nCarrying the tiny withering flame of a time thirty six years ago when America felt young, \nas though there was nowhere we could not go \nnothing we couldn't do. \n\nOn that day in February when we all stopped and watched Cronkite, Brinkley and Chancellor on black and white screens…. \ncount down the last seconds as Johnny Glenn was to about to become the first American to orbit the Earth. \nHigh atop the volatile Atlas Rocket \nThat had exploded in a wall of white hot flame so many times during disastrous launches . \n\nWhen he and Shepherd, Grissom and Carpenter were writing the text book \nOf how to fly that tiny tin can atop world's biggest fire cracker. \nWe all watched and prayed when Glenn told Mission Control that a light inside his capsule said that his heat shield was loose causing he and Friendship 7 to burn up on reentry. \n\nAs if it was predestination, the boy scout from Ohio safely parachuted Friendship 7 into the Pacific as if it were all from a paperback novel. \n\nIt was a bright shining moment in a clear crystal time, \nwhen the shadows behind the legends were washed away by the light of a nations dreams. \n\nJohnny Glenn is going to ride the lightning one more time \n\nAs the children and children's children of the New Frontier \nWatch Cronkite, Brokaw and Rather count it down. \nCount down the lift off that will hold the man, who probably has no interest of knowing that he may well hold the lost dreams of a fractured nation. \n\nA Nation who's heart had been broken by Vietnam, assassinations, scandals and leaders who have sold our future down the river for the fast buck and tainted power. \n\nPeople are coming from all over America, from all over the World and they really can't tell you why. \nAs the people in Close Encounters of the Third Kind who kept drawing Devils Tower. \nThey just want to be there and be a part of it all. \n\nTo stand as a witness to the lift off that has become a pre millenium Resurrection for the tiny light that burned so deeply inside of us that we didn't know it was still there \n\nJohnny Glenn is going to ride the lightning one more time.. \n\nAnd in that moment of lift off.. \nWe all might dare, perhaps for just a moment, \nTo dream again of bright futures and newer worlds. \n\nJohnny Glenn is going to ride the lightning \n\nOne more time.. \n\nAnd we're going to ride it with him \n\nOne more time, \n\nOnce again… \n\n",
    "Lyrics Detail": "John Stewart Lyrics Database",
    "Recording": "Unreleased",
    "Songwriter": "John Stewart",
    "Tab": "\n\n",
    "Title": "TO RIDE THE LIGHTNING (ONE MORE TIME)"
  },
  "Critera": {
    "Recording": [
      "Unreleased"
    ],
    "songwriter": [
      "John Stewart"
    ]
  },
  "id": 314
}